In [1]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import time

In [139]:
df = pd.read_csv("D:\\MajorProject\\Datasets_1\\ZFinal_dataset.csv")
dfHCL = pd.read_csv("D:\\MajorProject\\Datasets_1\\HCL Technologies Ltd.csv")

In [85]:
df.tail()

,Date,Open,High,Low,Close,Adj Close,Volume,Company
65049,2019-12-23,529.950012,535.900024,524.700012,525.900024,502.017120,2963573.0,Mahindra&Mahindra
65050,2019-12-24,529.000000,532.650024,526.200012,527.500000,503.544373,2372038.0,Mahindra&Mahindra
65051,2019-12-26,530.000000,536.200012,527.049988,528.349976,504.355682,4623580.0,Mahindra&Mahindra
65052,2019-12-27,529.900024,532.750000,525.049988,530.150024,506.074066,3017840.0,Mahindra&Mahindra
65053,2019-12-30,531.349976,539.849976,531.349976,536.900024,512.517456,4697710.0,Mahindra&Mahindra

In [86]:
df["Date"].nunique()

2957

In [87]:
df["Open"].nunique()

34487

In [88]:
df["High"].nunique()

39243

In [89]:
df["Low"].nunique()

41189

In [90]:
df["Close"].nunique()

50326

In [91]:
df["Adj Close"].nunique()

62263

In [92]:
df["Volume"].nunique()

63695

In [103]:
# df["Adj Close"].isnull().values.any()
df["Adj Close"].isnull().sum()

153

In [102]:
# df["Close"].isnull().values.any()
df["Close"].isnull().sum()

153

In [101]:
# df["Date"].isnull().sum()
# df["Open"].isnull().sum()
# df["High"].isnull().sum()
# df["Low"].isnull().sum()
# df["Volume"].isnull().sum()

153

In [112]:
# for i in df:
#     if i[i["Company"]]=="Reliance Industries Ltd"
dfna=df[df["Close"].isna()]

In [138]:
dfna.head(8)
# 2010-02-06: 6th feb 2010 : saturday

# 2012-01-07: 7th Jan 2012: saturday, 
# 2012-03-03: 3rd March 2012: saturday, 
# 2012-09-08: 8th Sep 2012: saturday, 
# 2012-11-11: 11th November 2012: sunday, 
# 2014-03-22: 22nd March 2014: saturday, 
# 2015-02-28: 28th Feb 2015: saturday;  HCL Technologies Ltd

,Date,Open,High,Low,Close,Adj Close,Volume,Company
513,2010-02-06,NaN,NaN,NaN,NaN,NaN,NaN,Reliance Industries Ltd
991,2012-01-07,NaN,NaN,NaN,NaN,NaN,NaN,Reliance Industries Ltd
1030,2012-03-03,NaN,NaN,NaN,NaN,NaN,NaN,Reliance Industries Ltd
1160,2012-09-08,NaN,NaN,NaN,NaN,NaN,NaN,Reliance Industries Ltd
1202,2012-11-11,NaN,NaN,NaN,NaN,NaN,NaN,Reliance Industries Ltd
1539,2014-03-22,NaN,NaN,NaN,NaN,NaN,NaN,Reliance Industries Ltd
1768,2015-02-28,NaN,NaN,NaN,NaN,NaN,NaN,Reliance Industries Ltd
3470,2010-02-06,NaN,NaN,NaN,NaN,NaN,NaN,HDFC Bank Ltd

In [115]:
dfna["Date"].nunique()

7

In [116]:
dfna["Company"].nunique()

22

In [140]:
dfHCL.head(10)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2008-01-01,83.000000,83.612503,80.074997,80.512497,55.720848,730260.0
1,2008-01-02,80.487503,81.474998,78.262497,78.587502,54.388577,1896700.0
2,2008-01-03,79.000000,79.187500,77.012497,77.500000,53.635952,2943936.0
3,2008-01-04,77.750000,79.237503,77.012497,78.762497,54.509697,2431480.0
4,2008-01-07,79.000000,79.000000,74.400002,74.824997,51.784660,5565516.0
5,2008-01-08,73.812500,76.599998,73.812500,75.212502,52.052830,3877976.0
6,2008-01-09,77.099998,77.099998,74.750000,75.025002,51.923077,4305368.0
7,2008-01-10,76.250000,76.250000,73.775002,74.050003,51.248302,1519052.0
8,2008-01-11,74.500000,75.000000,71.150002,72.224998,49.985245,3117668.0
9,2008-01-14,72.512497,73.000000,70.000000,70.974998,49.120136,1338160.0

In [145]:
dfHCL[dfHCL["Date"]=="2010-02-06"]

           Date   Open  High        Low      Close  Adj Close  Volume
513  2010-02-06  85.25  85.5  84.287498  84.862503  63.861645     0.0